DROP DATABASE  IF EXISTS xianhu;
SET NAMES UTF8;
CREATE DATABASE xianhu CHARSET=UTF8;
USE xianhu;
CREATE TABLE xh_user(
  uid INT PRIMARY KEY AUTO_INCREMENT,
  uname VARCHAR(32) UNIQUE NOT NULL,
  upwd VARCHAR(32),
  email VARCHAR(64),
  phone VARCHAR(16),
  avatar VARCHAR(128) DEFAULT 'img/avatar/default.png',
  user_name VARCHAR(32),
  gender INT
--  #0-女  1-男
);
INSERT INTO xh_user VALUES
(NULL,'qingfei','123456','qing@126.cn','11111','img/avatar/default.png','庆飞',1);


INSERT INTO xh_manhua VALUES(
NULL,'img/product/p2.png','img/product/p2.png','愚公移山','乎闲乎','闲乎闲','闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，最终……'
),
(NULL,'img/product/p3.png','img/product/p1.png','排山蹈海','乎闲乎','闲乎闲','闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，最终……'
),
(NULL,'img/product/p4.png','img/product/p3.png','煮酒论英雄','乎闲乎','闲乎闲','闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，最终……'
),
(NULL,'img/product/p1.png','img/product/p4.png','对酒当歌','乎闲乎','闲乎闲','闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，最终……'
),
(NULL,'img/product/p2.png','img/product/p1.png','梅花三弄','乎闲乎','闲乎闲','闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，最终……'
)
CREATE TABLE xh_bbs(
     bid INT PRIMARY KEY AUTO_INCREMENT,
     nickname VARCHAR(16),
     title VARCHAR(64),
     wtime DATETIME,
     answer VARCHAR(128)
   );
   INSERT INTO xh_bbs VALUES
   (NULL,"会飞的猫" ,"我一篇好的文章怎么投稿" ,now() ,"闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，最终……"),
   (NULL,'会飞的猫','闲乎的场景都那些',now(),'闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，最终……'),
   (NULL,'会飞的猫','有一篇文章超级赞，值得推荐',now(),'闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，最终……'),
   (NULL,'会飞的猫','我好想喜欢上漫画中的男主了，什么时候出新故事',now(),'闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，最终……'),
   (NULL,'会飞的猫','很期待你们的新作品，我都想加入你们了',now(),'闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，最终……'),
   (NULL,'会飞的猫','闲和乎的结局是什么？他们在一起了吗',now(),'闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，最终……'),
   (NULL,'会飞的猫','我每天都看你们工作号的文章，赞赞的，你们的标题都是谁想的，那么诗意',now(),'闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，最终……'),
   (NULL,'会飞的猫','你们公司的位置在哪里，能不能去参观',now(),'闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，最终……'),
   (NULL,'会飞的猫','我一篇好的文章怎么投稿',now(),'闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，最终……'),
   (NULL,'会飞的猫','图上是你们公司的真是的场景吗？是自己公司设计的吗',now(),'闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，最终……'),
   (NULL,'会飞的猫','闲乎的场景都那些',now(),'闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，最终……'),
   (NULL,'会飞的猫','有一篇文章超级赞，值得推荐',now(),'闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，最终……'),
   (NULL,'会飞的猫','我好想喜欢上漫画中的男主了，什么时候出新故事',now(),'闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，最终……'),
   (NULL,'会飞的猫','很期待你们的新作品，我都想加入你们了',now(),'闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，最终……'),
   (NULL,'会飞的猫','闲和乎的结局是什么？他们在一起了吗',now(),'闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，最终……'),
   (NULL,'会飞的猫','我每天都看你们工作号的文章，赞赞的，你们的标题都是谁想的，那么诗意',now(),'闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，最终……'),
   (NULL,'会飞的猫','你们公司的位置在哪里，能不能去参观',now(),'闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，最终……'),
   (NULL,'会飞的猫','我一篇好的文章怎么投稿',now(),'闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，闲和乎的一场意外相遇，相互谁都看不上谁，最终……')